<!-- dflook/terraform-github-actions {"workspace":"checkoutv4","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"c4494d0745e97f61153b1022bd91dcf81eb8e6eacf188d18361edc08ad3d4a2c","plan_job_ref":"Job Test plan target and replace #425 at https://github.com/dflook/terraform-github-actions/actions/runs/9331436354","plan_hash":"874191b1dff5875f6b834cead6d5ca26b65560c604318558c9f91fef6f0ec228","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __checkoutv4__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "LxGgmGtGz4" -> (known after apply)
!~  foreach = "yJ0JJc5yEQ" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #425](https://github.com/dflook/terraform-github-actions/actions/runs/9331436354)